notes/app/controllers/notes_controller.rb

INSERT INTO "notes" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @note = Note.new(note_params)

    if @note.save